009_mix_orioledb_hybrid/pgbench_write_2022-05-24T06:55:06.243898943.log
progress: 10.0 s, 28640.1 tps, lat 1.710 ms stddev 8.879
progress: 20.0 s, 21944.4 tps, lat 2.244 ms stddev 1.217
progress: 30.0 s, 21903.8 tps, lat 2.248 ms stddev 1.291
progress: 40.0 s, 20513.4 tps, lat 2.404 ms stddev 11.588
progress: 50.0 s, 20899.5 tps, lat 2.211 ms stddev 1.176
progress: 60.0 s, 22044.6 tps, lat 2.375 ms stddev 10.027
progress: 70.0 s, 20691.8 tps, lat 2.384 ms stddev 11.586
progress: 80.0 s, 22412.4 tps, lat 2.199 ms stddev 1.252
progress: 90.0 s, 20940.1 tps, lat 2.355 ms stddev 10.201
progress: 100.0 s, 22299.3 tps, lat 2.209 ms stddev 1.453
progress: 110.0 s, 20987.3 tps, lat 2.350 ms stddev 9.942
progress: 120.0 s, 22202.2 tps, lat 2.220 ms stddev 1.265
progress: 130.0 s, 20796.4 tps, lat 2.371 ms stddev 10.819
progress: 140.0 s, 22487.4 tps, lat 2.191 ms stddev 1.406
progress: 150.0 s, 20863.9 tps, lat 2.364 ms stddev 11.583
progress: 160.0 s, 21137.9 tps, lat 2.334 ms stddev 9.650
progress: 170.0 s, 22357.0 tps, lat 2.204 ms stddev 1.402
progress: 180.0 s, 22261.8 tps, lat 2.213 ms stddev 1.285
progress: 190.0 s, 20715.7 tps, lat 2.382 ms stddev 11.981
progress: 200.0 s, 20870.9 tps, lat 2.364 ms stddev 10.852
progress: 210.0 s, 21029.0 tps, lat 2.346 ms stddev 10.632
progress: 220.0 s, 22431.6 tps, lat 2.197 ms stddev 1.282
progress: 230.0 s, 21092.7 tps, lat 2.339 ms stddev 10.830
progress: 240.0 s, 21751.9 tps, lat 2.267 ms stddev 3.811
progress: 250.0 s, 20851.3 tps, lat 2.367 ms stddev 11.342
progress: 260.0 s, 22618.1 tps, lat 2.180 ms stddev 1.251
progress: 270.0 s, 20708.4 tps, lat 2.383 ms stddev 11.724
progress: 280.0 s, 22374.1 tps, lat 2.203 ms stddev 2.071
progress: 290.0 s, 21144.0 tps, lat 2.333 ms stddev 9.991
progress: 300.0 s, 22325.7 tps, lat 2.208 ms stddev 1.189
progress: 310.0 s, 20718.8 tps, lat 2.382 ms stddev 11.289
progress: 320.0 s, 21019.6 tps, lat 2.347 ms stddev 10.318
progress: 330.0 s, 20875.4 tps, lat 2.363 ms stddev 10.545
progress: 340.0 s, 22525.1 tps, lat 2.189 ms stddev 1.175
progress: 350.0 s, 20713.6 tps, lat 2.382 ms stddev 10.679
progress: 360.0 s, 20776.2 tps, lat 2.374 ms stddev 9.789
progress: 370.0 s, 20811.0 tps, lat 2.371 ms stddev 10.648
progress: 380.0 s, 22380.0 tps, lat 2.202 ms stddev 1.213
progress: 390.0 s, 20586.8 tps, lat 2.396 ms stddev 10.048
progress: 400.0 s, 22209.6 tps, lat 2.219 ms stddev 1.882
progress: 410.0 s, 20664.2 tps, lat 2.388 ms stddev 11.618
progress: 420.0 s, 22200.7 tps, lat 2.220 ms stddev 1.301
progress: 430.0 s, 20628.0 tps, lat 2.391 ms stddev 10.172
progress: 440.0 s, 21645.7 tps, lat 2.278 ms stddev 3.159
progress: 450.0 s, 22218.2 tps, lat 2.219 ms stddev 1.212
progress: 460.0 s, 22128.5 tps, lat 2.227 ms stddev 1.281
progress: 470.0 s, 20472.8 tps, lat 2.410 ms stddev 11.720
progress: 480.0 s, 20446.4 tps, lat 2.412 ms stddev 11.215
progress: 490.0 s, 20577.0 tps, lat 2.397 ms stddev 10.575
progress: 500.0 s, 22124.7 tps, lat 2.228 ms stddev 1.257
progress: 510.0 s, 21547.2 tps, lat 2.288 ms stddev 4.244
progress: 520.0 s, 20535.6 tps, lat 2.402 ms stddev 11.006
progress: 530.0 s, 20774.6 tps, lat 2.371 ms stddev 10.043
progress: 540.0 s, 22037.0 tps, lat 2.239 ms stddev 1.231
progress: 550.0 s, 20646.1 tps, lat 2.390 ms stddev 10.591
progress: 560.0 s, 22075.9 tps, lat 2.233 ms stddev 1.224
progress: 570.0 s, 20460.9 tps, lat 2.410 ms stddev 10.213
progress: 580.0 s, 21734.7 tps, lat 2.266 ms stddev 3.832
progress: 590.0 s, 21353.5 tps, lat 2.258 ms stddev 1.742
progress: 600.0 s, 22050.1 tps, lat 2.279 ms stddev 3.468
progress: 610.0 s, 21429.1 tps, lat 2.298 ms stddev 3.379
progress: 620.0 s, 20550.1 tps, lat 2.397 ms stddev 10.262
progress: 630.0 s, 20301.3 tps, lat 2.424 ms stddev 10.599
progress: 640.0 s, 22103.2 tps, lat 2.229 ms stddev 1.123
progress: 650.0 s, 20466.7 tps, lat 2.410 ms stddev 10.795
progress: 660.0 s, 20232.3 tps, lat 2.438 ms stddev 11.129
progress: 670.0 s, 19993.7 tps, lat 2.467 ms stddev 11.635
progress: 680.0 s, 22161.6 tps, lat 2.224 ms stddev 1.157
progress: 690.0 s, 21507.0 tps, lat 2.292 ms stddev 3.523
progress: 700.0 s, 21839.2 tps, lat 2.258 ms stddev 3.242
progress: 710.0 s, 21656.1 tps, lat 2.275 ms stddev 3.779
progress: 720.0 s, 21836.8 tps, lat 2.258 ms stddev 1.279
progress: 730.0 s, 20488.4 tps, lat 2.408 ms stddev 11.417
progress: 740.0 s, 21570.7 tps, lat 2.285 ms stddev 3.190
progress: 750.0 s, 20319.3 tps, lat 2.428 ms stddev 11.082
progress: 760.0 s, 21685.7 tps, lat 2.273 ms stddev 3.037
progress: 770.0 s, 21956.4 tps, lat 2.244 ms stddev 1.191
progress: 780.0 s, 21998.5 tps, lat 2.241 ms stddev 1.165
progress: 790.0 s, 20563.9 tps, lat 2.400 ms stddev 11.323
progress: 800.0 s, 21453.6 tps, lat 2.298 ms stddev 3.271
progress: 810.0 s, 21787.6 tps, lat 2.262 ms stddev 1.270
progress: 820.0 s, 20517.7 tps, lat 2.404 ms stddev 11.012
progress: 830.0 s, 19794.6 tps, lat 2.482 ms stddev 4.000
progress: 840.0 s, 19448.0 tps, lat 2.523 ms stddev 2.136
progress: 850.0 s, 21061.1 tps, lat 2.338 ms stddev 1.533
progress: 860.0 s, 21398.2 tps, lat 2.303 ms stddev 1.294
progress: 870.0 s, 21209.0 tps, lat 2.323 ms stddev 1.311
progress: 880.0 s, 21612.7 tps, lat 2.280 ms stddev 1.178
progress: 890.0 s, 21535.5 tps, lat 2.288 ms stddev 1.195
progress: 900.0 s, 21324.6 tps, lat 2.309 ms stddev 1.232
progress: 910.0 s, 21737.3 tps, lat 2.268 ms stddev 1.163
progress: 920.0 s, 21500.2 tps, lat 2.290 ms stddev 1.195
progress: 930.0 s, 21521.9 tps, lat 2.289 ms stddev 1.178
progress: 940.0 s, 21344.1 tps, lat 2.308 ms stddev 1.265
progress: 950.0 s, 21703.6 tps, lat 2.270 ms stddev 1.166
progress: 960.0 s, 21405.6 tps, lat 2.299 ms stddev 1.214
progress: 970.0 s, 20831.4 tps, lat 2.361 ms stddev 1.318
progress: 980.0 s, 21340.0 tps, lat 2.304 ms stddev 1.239
progress: 990.0 s, 21499.0 tps, lat 2.290 ms stddev 1.176
progress: 1000.0 s, 21439.7 tps, lat 2.293 ms stddev 1.169
progress: 1010.0 s, 21524.7 tps, lat 2.287 ms stddev 1.165
progress: 1020.0 s, 20927.8 tps, lat 2.349 ms stddev 1.286
progress: 1030.0 s, 20729.1 tps, lat 2.372 ms stddev 2.372
progress: 1040.0 s, 20902.7 tps, lat 2.354 ms stddev 2.727
progress: 1050.0 s, 19865.5 tps, lat 2.475 ms stddev 3.504
progress: 1060.0 s, 20293.1 tps, lat 2.413 ms stddev 2.379
progress: 1070.0 s, 20676.4 tps, lat 2.375 ms stddev 1.294
progress: 1080.0 s, 20831.3 tps, lat 2.359 ms stddev 1.264
progress: 1090.0 s, 20163.4 tps, lat 2.427 ms stddev 1.357
progress: 1100.0 s, 20527.5 tps, lat 2.389 ms stddev 1.283
progress: 1110.0 s, 19828.3 tps, lat 2.460 ms stddev 1.378
progress: 1120.0 s, 19846.2 tps, lat 2.459 ms stddev 1.320
progress: 1130.0 s, 19630.8 tps, lat 2.486 ms stddev 1.369
progress: 1140.0 s, 19696.3 tps, lat 2.477 ms stddev 1.377
progress: 1150.0 s, 20477.5 tps, lat 2.394 ms stddev 1.284
progress: 1160.0 s, 20910.4 tps, lat 2.349 ms stddev 1.239
progress: 1170.0 s, 20858.6 tps, lat 2.355 ms stddev 1.272
progress: 1180.0 s, 20757.3 tps, lat 2.369 ms stddev 1.346
progress: 1190.0 s, 20151.8 tps, lat 2.429 ms stddev 1.345
progress: 1200.0 s, 20765.8 tps, lat 2.365 ms stddev 1.265
progress: 1210.0 s, 20851.0 tps, lat 2.360 ms stddev 1.224
progress: 1220.0 s, 20853.1 tps, lat 2.358 ms stddev 1.237
progress: 1230.0 s, 21116.9 tps, lat 2.332 ms stddev 1.420
progress: 1240.0 s, 21003.9 tps, lat 2.345 ms stddev 1.195
progress: 1250.0 s, 21282.7 tps, lat 2.315 ms stddev 1.207
progress: 1260.0 s, 21099.7 tps, lat 2.336 ms stddev 1.225
progress: 1270.0 s, 21099.5 tps, lat 2.336 ms stddev 1.244
progress: 1280.0 s, 21382.6 tps, lat 2.305 ms stddev 1.150
progress: 1290.0 s, 21198.1 tps, lat 2.326 ms stddev 1.189
progress: 1300.0 s, 21074.1 tps, lat 2.338 ms stddev 1.245
progress: 1310.0 s, 21179.4 tps, lat 2.327 ms stddev 1.213
progress: 1320.0 s, 20845.9 tps, lat 2.365 ms stddev 1.274
progress: 1330.0 s, 21193.1 tps, lat 2.325 ms stddev 1.205
progress: 1340.0 s, 21151.0 tps, lat 2.330 ms stddev 1.265
progress: 1350.0 s, 21082.5 tps, lat 2.337 ms stddev 1.235
progress: 1360.0 s, 21015.3 tps, lat 2.344 ms stddev 1.282
progress: 1370.0 s, 21286.8 tps, lat 2.315 ms stddev 1.221
progress: 1380.0 s, 21064.4 tps, lat 2.339 ms stddev 1.207
progress: 1390.0 s, 20120.3 tps, lat 2.450 ms stddev 3.008
progress: 1400.0 s, 20572.2 tps, lat 2.394 ms stddev 1.389
progress: 1410.0 s, 20744.1 tps, lat 2.374 ms stddev 1.260
progress: 1420.0 s, 20414.8 tps, lat 2.409 ms stddev 1.303
progress: 1430.0 s, 20588.2 tps, lat 2.393 ms stddev 1.399
progress: 1440.0 s, 20622.8 tps, lat 2.385 ms stddev 1.250
progress: 1450.0 s, 20692.7 tps, lat 2.377 ms stddev 1.322
progress: 1460.0 s, 20757.1 tps, lat 2.369 ms stddev 1.304
progress: 1470.0 s, 20166.4 tps, lat 2.435 ms stddev 1.512
progress: 1480.0 s, 20524.0 tps, lat 2.394 ms stddev 1.291
progress: 1490.0 s, 19731.2 tps, lat 2.495 ms stddev 3.223
progress: 1500.0 s, 20646.3 tps, lat 2.379 ms stddev 1.232
progress: 1510.0 s, 20274.3 tps, lat 2.425 ms stddev 1.847
progress: 1520.0 s, 20419.8 tps, lat 2.409 ms stddev 1.709
progress: 1530.0 s, 19855.1 tps, lat 2.471 ms stddev 2.523
progress: 1540.0 s, 20600.3 tps, lat 2.383 ms stddev 1.239
progress: 1550.0 s, 20353.2 tps, lat 2.410 ms stddev 1.343
progress: 1560.0 s, 20634.8 tps, lat 2.380 ms stddev 1.280
progress: 1570.0 s, 20995.8 tps, lat 2.339 ms stddev 1.212
progress: 1580.0 s, 20985.9 tps, lat 2.341 ms stddev 1.197
progress: 1590.0 s, 20773.9 tps, lat 2.365 ms stddev 1.239
progress: 1600.0 s, 20599.3 tps, lat 2.383 ms stddev 1.267
progress: 1610.0 s, 20691.1 tps, lat 2.374 ms stddev 1.273
progress: 1620.0 s, 20325.7 tps, lat 2.418 ms stddev 2.470
progress: 1630.0 s, 20345.8 tps, lat 2.409 ms stddev 1.275
progress: 1640.0 s, 20588.2 tps, lat 2.385 ms stddev 1.270
progress: 1650.0 s, 20499.1 tps, lat 2.392 ms stddev 1.298
progress: 1660.0 s, 20631.0 tps, lat 2.383 ms stddev 1.341
progress: 1670.0 s, 20791.6 tps, lat 2.367 ms stddev 1.198
progress: 1680.0 s, 20479.1 tps, lat 2.398 ms stddev 1.279
progress: 1690.0 s, 20728.8 tps, lat 2.370 ms stddev 1.207
progress: 1700.0 s, 20709.8 tps, lat 2.374 ms stddev 1.522
progress: 1710.0 s, 20622.5 tps, lat 2.385 ms stddev 1.291
progress: 1720.0 s, 20322.5 tps, lat 2.422 ms stddev 1.289
progress: 1730.0 s, 20477.7 tps, lat 2.399 ms stddev 1.279
progress: 1740.0 s, 19668.0 tps, lat 2.491 ms stddev 1.372
progress: 1750.0 s, 20300.8 tps, lat 2.421 ms stddev 1.422
progress: 1760.0 s, 20814.8 tps, lat 2.366 ms stddev 1.226
progress: 1770.0 s, 20877.0 tps, lat 2.361 ms stddev 1.200
progress: 1780.0 s, 20685.2 tps, lat 2.381 ms stddev 1.288
progress: 1790.0 s, 20769.9 tps, lat 2.372 ms stddev 1.326
progress: 1800.0 s, 20710.9 tps, lat 2.378 ms stddev 1.596
progress: 1810.0 s, 20769.8 tps, lat 2.372 ms stddev 1.812
progress: 1820.0 s, 20241.9 tps, lat 2.436 ms stddev 4.105
progress: 1830.0 s, 20252.9 tps, lat 2.431 ms stddev 2.636
progress: 1840.0 s, 20980.1 tps, lat 2.346 ms stddev 1.207
progress: 1850.0 s, 20970.6 tps, lat 2.348 ms stddev 1.304
progress: 1860.0 s, 20882.5 tps, lat 2.357 ms stddev 1.228
progress: 1870.0 s, 21091.8 tps, lat 2.334 ms stddev 1.193
progress: 1880.0 s, 20537.9 tps, lat 2.399 ms stddev 2.377
progress: 1890.0 s, 20657.1 tps, lat 2.380 ms stddev 2.048
progress: 1900.0 s, 19940.4 tps, lat 2.471 ms stddev 3.344
progress: 1910.0 s, 20566.0 tps, lat 2.392 ms stddev 2.270
progress: 1920.0 s, 20341.8 tps, lat 2.419 ms stddev 2.560
progress: 1930.0 s, 20546.3 tps, lat 2.395 ms stddev 1.343
progress: 1940.0 s, 20427.2 tps, lat 2.408 ms stddev 1.330
progress: 1950.0 s, 20157.5 tps, lat 2.437 ms stddev 1.327
progress: 1960.0 s, 20362.6 tps, lat 2.410 ms stddev 1.335
progress: 1970.0 s, 20478.4 tps, lat 2.401 ms stddev 1.299
progress: 1980.0 s, 17427.7 tps, lat 2.815 ms stddev 6.123
progress: 1990.0 s, 13677.4 tps, lat 3.638 ms stddev 15.085
progress: 2000.0 s, 20498.4 tps, lat 2.407 ms stddev 3.451
progress: 2010.0 s, 20910.1 tps, lat 2.357 ms stddev 0.830
progress: 2020.0 s, 21279.8 tps, lat 2.317 ms stddev 0.769
progress: 2030.0 s, 21334.2 tps, lat 2.311 ms stddev 0.859
progress: 2040.0 s, 21480.7 tps, lat 2.296 ms stddev 0.770
progress: 2050.0 s, 21435.9 tps, lat 2.300 ms stddev 0.826
progress: 2060.0 s, 21210.0 tps, lat 2.324 ms stddev 0.844
progress: 2070.0 s, 21158.1 tps, lat 2.331 ms stddev 0.872
progress: 2080.0 s, 21022.3 tps, lat 2.343 ms stddev 0.887
progress: 2090.0 s, 21498.8 tps, lat 2.293 ms stddev 0.830
progress: 2100.0 s, 21352.4 tps, lat 2.308 ms stddev 0.835
progress: 2110.0 s, 21472.2 tps, lat 2.295 ms stddev 0.780
progress: 2120.0 s, 21907.7 tps, lat 2.250 ms stddev 0.730
progress: 2130.0 s, 21545.0 tps, lat 2.288 ms stddev 0.797
progress: 2140.0 s, 21778.9 tps, lat 2.264 ms stddev 0.772
progress: 2150.0 s, 21762.2 tps, lat 2.265 ms stddev 0.769
progress: 2160.0 s, 21485.3 tps, lat 2.293 ms stddev 0.807
progress: 2170.0 s, 21911.5 tps, lat 2.250 ms stddev 0.750
progress: 2180.0 s, 21535.4 tps, lat 2.286 ms stddev 0.785
progress: 2190.0 s, 20984.0 tps, lat 2.346 ms stddev 0.867
progress: 2200.0 s, 21234.6 tps, lat 2.318 ms stddev 0.836
progress: 2210.0 s, 21514.8 tps, lat 2.288 ms stddev 0.878
progress: 2220.0 s, 21821.0 tps, lat 2.259 ms stddev 0.740
progress: 2230.0 s, 21474.6 tps, lat 2.293 ms stddev 0.840
progress: 2240.0 s, 21495.5 tps, lat 2.293 ms stddev 0.800
progress: 2250.0 s, 21274.9 tps, lat 2.315 ms stddev 0.839
progress: 2260.0 s, 21286.4 tps, lat 2.314 ms stddev 0.898
progress: 2270.0 s, 21624.4 tps, lat 2.278 ms stddev 0.771
progress: 2280.0 s, 21106.0 tps, lat 2.332 ms stddev 0.848
progress: 2290.0 s, 21248.9 tps, lat 2.318 ms stddev 0.833
progress: 2300.0 s, 21497.1 tps, lat 2.291 ms stddev 0.799
progress: 2310.0 s, 21420.6 tps, lat 2.297 ms stddev 0.869
progress: 2320.0 s, 21689.8 tps, lat 2.270 ms stddev 0.743
progress: 2330.0 s, 21317.5 tps, lat 2.305 ms stddev 0.837
progress: 2340.0 s, 21036.6 tps, lat 2.336 ms stddev 0.882
progress: 2350.0 s, 21745.8 tps, lat 2.265 ms stddev 0.770
progress: 2360.0 s, 21490.9 tps, lat 2.290 ms stddev 0.807
progress: 2370.0 s, 21417.0 tps, lat 2.298 ms stddev 0.829
progress: 2380.0 s, 21458.6 tps, lat 2.294 ms stddev 0.843
progress: 2390.0 s, 21251.4 tps, lat 2.316 ms stddev 0.845
progress: 2400.0 s, 21406.3 tps, lat 2.302 ms stddev 0.790
progress: 2410.0 s, 21196.7 tps, lat 2.322 ms stddev 0.846
progress: 2420.0 s, 21363.2 tps, lat 2.306 ms stddev 0.825
progress: 2430.0 s, 20756.2 tps, lat 2.370 ms stddev 0.918
progress: 2440.0 s, 20656.5 tps, lat 2.382 ms stddev 0.950
progress: 2450.0 s, 20876.8 tps, lat 2.357 ms stddev 1.071
progress: 2460.0 s, 20323.7 tps, lat 2.416 ms stddev 1.313
progress: 2470.0 s, 20161.4 tps, lat 2.430 ms stddev 1.308
progress: 2480.0 s, 19904.0 tps, lat 2.466 ms stddev 2.491
progress: 2490.0 s, 19527.8 tps, lat 2.523 ms stddev 3.823
progress: 2500.0 s, 19795.8 tps, lat 2.485 ms stddev 3.101
progress: 2510.0 s, 20084.2 tps, lat 2.447 ms stddev 1.923
progress: 2520.0 s, 18686.4 tps, lat 2.632 ms stddev 4.390
progress: 2530.0 s, 20244.7 tps, lat 2.434 ms stddev 2.862
progress: 2540.0 s, 20334.8 tps, lat 2.421 ms stddev 2.128
progress: 2550.0 s, 19587.0 tps, lat 2.511 ms stddev 3.248
progress: 2560.0 s, 19446.8 tps, lat 2.531 ms stddev 4.006
progress: 2570.0 s, 20083.4 tps, lat 2.450 ms stddev 2.021
progress: 2580.0 s, 20182.5 tps, lat 2.439 ms stddev 1.318
progress: 2590.0 s, 19297.2 tps, lat 2.552 ms stddev 3.678
progress: 2600.0 s, 20543.7 tps, lat 2.394 ms stddev 1.246
progress: 2610.0 s, 20158.6 tps, lat 2.439 ms stddev 1.664
progress: 2620.0 s, 20101.1 tps, lat 2.451 ms stddev 2.486
progress: 2630.0 s, 19992.0 tps, lat 2.460 ms stddev 2.463
progress: 2640.0 s, 19565.2 tps, lat 2.511 ms stddev 1.672
progress: 2650.0 s, 19858.5 tps, lat 2.477 ms stddev 2.049
progress: 2660.0 s, 19823.1 tps, lat 2.477 ms stddev 1.365
progress: 2670.0 s, 20043.4 tps, lat 2.450 ms stddev 1.354
progress: 2680.0 s, 19796.7 tps, lat 2.481 ms stddev 1.494
progress: 2690.0 s, 20178.5 tps, lat 2.437 ms stddev 1.311
progress: 2700.0 s, 19372.3 tps, lat 2.532 ms stddev 1.824
progress: 2710.0 s, 20457.4 tps, lat 2.401 ms stddev 1.277
progress: 2720.0 s, 19914.2 tps, lat 2.462 ms stddev 1.354
progress: 2730.0 s, 20077.9 tps, lat 2.445 ms stddev 1.342
progress: 2740.0 s, 20085.6 tps, lat 2.443 ms stddev 1.281
progress: 2750.0 s, 20429.0 tps, lat 2.408 ms stddev 1.300
progress: 2760.0 s, 19620.4 tps, lat 2.504 ms stddev 1.713
progress: 2770.0 s, 19833.5 tps, lat 2.473 ms stddev 1.331
progress: 2780.0 s, 20090.4 tps, lat 2.447 ms stddev 1.312
progress: 2790.0 s, 19843.2 tps, lat 2.476 ms stddev 1.301
progress: 2800.0 s, 19947.2 tps, lat 2.462 ms stddev 1.582
progress: 2810.0 s, 20315.5 tps, lat 2.419 ms stddev 1.217
progress: 2820.0 s, 19853.9 tps, lat 2.471 ms stddev 1.333
progress: 2830.0 s, 19878.2 tps, lat 2.469 ms stddev 1.331
progress: 2840.0 s, 20073.3 tps, lat 2.452 ms stddev 1.341
progress: 2850.0 s, 19632.1 tps, lat 2.501 ms stddev 1.343
progress: 2860.0 s, 18700.4 tps, lat 2.608 ms stddev 1.421
progress: 2870.0 s, 20056.6 tps, lat 2.451 ms stddev 1.296
progress: 2880.0 s, 20106.6 tps, lat 2.449 ms stddev 1.328
progress: 2890.0 s, 19865.4 tps, lat 2.474 ms stddev 1.377
progress: 2900.0 s, 19696.1 tps, lat 2.494 ms stddev 1.306
progress: 2910.0 s, 19787.7 tps, lat 2.483 ms stddev 1.344
progress: 2920.0 s, 19827.1 tps, lat 2.475 ms stddev 1.306
progress: 2930.0 s, 19447.9 tps, lat 2.517 ms stddev 1.350
progress: 2940.0 s, 19131.4 tps, lat 2.556 ms stddev 1.449
progress: 2950.0 s, 19790.1 tps, lat 2.483 ms stddev 1.372
progress: 2960.0 s, 20058.7 tps, lat 2.455 ms stddev 1.340
progress: 2970.0 s, 20114.0 tps, lat 2.447 ms stddev 1.442
progress: 2980.0 s, 18842.2 tps, lat 2.615 ms stddev 3.565
progress: 2990.0 s, 19737.0 tps, lat 2.494 ms stddev 2.184
progress: 3000.0 s, 19156.2 tps, lat 2.568 ms stddev 3.043
progress: 3010.0 s, 18974.7 tps, lat 2.593 ms stddev 2.991
progress: 3020.0 s, 19561.5 tps, lat 2.516 ms stddev 2.198
progress: 3030.0 s, 19251.8 tps, lat 2.556 ms stddev 2.476
progress: 3040.0 s, 18995.6 tps, lat 2.591 ms stddev 2.635
progress: 3050.0 s, 19121.7 tps, lat 2.576 ms stddev 2.927
progress: 3060.0 s, 19849.7 tps, lat 2.479 ms stddev 1.321
progress: 3070.0 s, 19657.0 tps, lat 2.504 ms stddev 1.406
progress: 3080.0 s, 20069.3 tps, lat 2.452 ms stddev 1.324
progress: 3090.0 s, 19930.9 tps, lat 2.468 ms stddev 1.382
progress: 3100.0 s, 19921.9 tps, lat 2.467 ms stddev 1.329
progress: 3110.0 s, 19859.6 tps, lat 2.476 ms stddev 1.360
progress: 3120.0 s, 19263.2 tps, lat 2.548 ms stddev 1.453
progress: 3130.0 s, 18575.4 tps, lat 2.630 ms stddev 2.663
progress: 3140.0 s, 15919.8 tps, lat 3.099 ms stddev 9.538
progress: 3150.0 s, 9358.5 tps, lat 4.855 ms stddev 11.495
progress: 3160.0 s, 6559.1 tps, lat 8.213 ms stddev 204.117
progress: 3170.0 s, 19687.5 tps, lat 2.502 ms stddev 0.915
progress: 3180.0 s, 20212.6 tps, lat 2.440 ms stddev 0.907
progress: 3190.0 s, 20402.2 tps, lat 2.416 ms stddev 0.983
progress: 3200.0 s, 20614.9 tps, lat 2.393 ms stddev 0.948
progress: 3210.0 s, 20179.6 tps, lat 2.445 ms stddev 1.014
progress: 3220.0 s, 20190.2 tps, lat 2.443 ms stddev 1.007
progress: 3230.0 s, 20613.3 tps, lat 2.394 ms stddev 0.905
progress: 3240.0 s, 20544.2 tps, lat 2.400 ms stddev 0.949
progress: 3250.0 s, 20590.4 tps, lat 2.395 ms stddev 0.945
progress: 3260.0 s, 21280.7 tps, lat 2.318 ms stddev 0.842
progress: 3270.0 s, 20176.2 tps, lat 2.444 ms stddev 1.069
progress: 3280.0 s, 20031.4 tps, lat 2.462 ms stddev 1.126
progress: 3290.0 s, 20329.9 tps, lat 2.427 ms stddev 1.055
progress: 3300.0 s, 20127.7 tps, lat 2.451 ms stddev 1.083
progress: 3310.0 s, 20226.9 tps, lat 2.436 ms stddev 1.026
progress: 3320.0 s, 20780.0 tps, lat 2.373 ms stddev 0.934
progress: 3330.0 s, 20548.5 tps, lat 2.400 ms stddev 0.935
progress: 3340.0 s, 20672.1 tps, lat 2.386 ms stddev 0.990
progress: 3350.0 s, 20693.5 tps, lat 2.385 ms stddev 1.006
progress: 3360.0 s, 20030.0 tps, lat 2.459 ms stddev 1.064
progress: 3370.0 s, 20575.2 tps, lat 2.399 ms stddev 0.980
progress: 3380.0 s, 20388.4 tps, lat 2.419 ms stddev 0.999
progress: 3390.0 s, 20771.3 tps, lat 2.371 ms stddev 0.912
progress: 3400.0 s, 20674.2 tps, lat 2.386 ms stddev 1.026
progress: 3410.0 s, 20925.2 tps, lat 2.355 ms stddev 0.927
progress: 3420.0 s, 19981.3 tps, lat 2.469 ms stddev 1.140
progress: 3430.0 s, 19598.1 tps, lat 2.514 ms stddev 1.205
progress: 3440.0 s, 19876.4 tps, lat 2.480 ms stddev 1.151
progress: 3450.0 s, 19932.5 tps, lat 2.471 ms stddev 1.085
progress: 3460.0 s, 20289.8 tps, lat 2.430 ms stddev 0.986
progress: 3470.0 s, 20513.7 tps, lat 2.405 ms stddev 0.967
progress: 3480.0 s, 19157.4 tps, lat 2.572 ms stddev 2.427
progress: 3490.0 s, 19526.9 tps, lat 2.523 ms stddev 1.217
progress: 3500.0 s, 19223.6 tps, lat 2.561 ms stddev 3.037
progress: 3510.0 s, 18178.7 tps, lat 2.707 ms stddev 3.027
progress: 3520.0 s, 20056.2 tps, lat 2.456 ms stddev 1.057
progress: 3530.0 s, 19925.7 tps, lat 2.470 ms stddev 1.021
progress: 3540.0 s, 19832.1 tps, lat 2.479 ms stddev 1.028
progress: 3550.0 s, 19781.3 tps, lat 2.489 ms stddev 1.120
progress: 3560.0 s, 18412.1 tps, lat 2.675 ms stddev 4.529
progress: 3570.0 s, 19109.5 tps, lat 2.574 ms stddev 1.298
progress: 3580.0 s, 19503.0 tps, lat 2.524 ms stddev 1.155
progress: 3590.0 s, 19191.0 tps, lat 2.562 ms stddev 1.133
progress: 3600.0 s, 19370.8 tps, lat 2.541 ms stddev 1.127
transaction type: pgbench_write_orioledb.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 5
duration: 3600 s
number of transactions actually processed: 74132141
latency average = 2.390 ms
latency stddev = 7.329 ms
tps = 20592.241450 (including connections establishing)
tps = 20592.270131 (excluding connections establishing)
statement latencies in milliseconds:
         0.001  \set region_id 0
         0.005  \set ns_id random_zipfian(1, 10, 1.1)
         0.002  \set emitter random_zipfian(1000, 3000, 1.1)
         0.001  \set root_player_id random(1, 100000*:scale)
         0.003  \set currency_id random_zipfian(1, 50, 1.1)
         0.000  \set amount random(1, 10000)
         0.188  BEGIN;
         0.402  INSERT INTO trx_pgbench_0
         0.363  INSERT INTO op_pgbench_0
         0.295  INSERT INTO balance_version_pgbench_0
         0.338  INSERT INTO balance_pgbench_0
         0.792  END;